app/Http/Controllers/website/WebsiteController.php

select * from `categories` where `status` = 1 order by `created_at` desc limit 13
select * from `products` where `status` = 1 order by `created_at` desc
select * from `products` where `status` = 1
---
    public function index(){
        try {
            $categories = Category::where('status',1)->latest()->take(13)->get();
            $products = Product::where('status',1)->latest()->get();

            return view('website.home.index',[
                'products'=>$products,
                'categories'=>$categories,
                'seller_products'=>Product::where('status',1)->get(),

select * from `products` where `status` = 1 order by `created_at` desc limit 12 offset 0
select count(*) as aggregate from `products` where `status` = 1
select * from `categories` where `status` = 1 order by `created_at` desc
select * from `colors` where `status` = 1 order by `created_at` desc
select * from `brands` where `status` = 1 order by `created_at` desc
---
    public function getAllProduct(){
        $products = Product::where('status', 1)->latest()->paginate(12);
        $categories = Category::where('status',1)->latest()->get();
        $colors = Color::where('status',1)->latest()->get();
        $brands = Brand::where('status',1)->latest()->get();

select * from `categories` where `name` = 'Punjabi' limit 1
select * from `sizes` where `status` = 1 order by `created_at` desc
select * from `products` where `category_id` = 9 and `status` = 1 order by `created_at` desc limit 12 offset 0
select count(*) as aggregate from `products` where `category_id` = 9 and `status` = 1
select * from `categories` where `status` = 1 order by `created_at` desc
---
    public function productByCategory($slug){
        try {
            $category = Category::where('name',$slug)->first();
            $sizes = Size::where('status',1)->latest()->get();
            $colors = color::where('status',1)->latest()->get();
            return view('website.category.product',[
                'products'=>Product::where('category_id',$category->id)->where('status',1)->latest()->paginate(12),
                'categories'=>Category::where('status',1)->latest()->get(),
                'sizes'     =>$sizes,
                'colors'    =>$colors,
                'slug'    =>$slug,
            ]);

select * from `products` where `slug` = 'easy-karchupi-panjabi-white-easy-karchupi-panjabi-white-easy-karchupi-panjabi-white-easy-karchupi-panjabi-white-easy-karchupi-panjabi-white-easy-karchupi-panjabi-white' and `status` = 1 limit 1
select * from `uploads` where `id` in ('', '', '')
select * from `product_reviews` where `user_id` = 1 and `product_id` = 17 limit 1
select * from `product_reviews` where `user_id` not in (1) and `product_id` = 17
select * from `orders` where `user_id` = 1 and `order_status` = 1
---
    public function productDetails($slug){
        try {
            $product = Product::where('slug',$slug)->where('status',1)->first();
            $images = json_decode($product->other_image);
            if(isset($images)){
                $otherImages = Upload::whereIn('id', $images)->get();
            }
            else{
                $otherImages = null;
            }

            if ($product->user_id != 1){
                $seller = Seller::where('user_id',$product->user_id)->first();
                $sellerShop = SellerShopSetting::where('seller_id',$seller->id)->first();
            }
            else{
                $seller = '';
                $sellerShop = '';
            }

            if (auth()->user()){
                $review = ProductReview::where('user_id',auth()->user()->id)->where('product_id',$product->id)->first();
                $reviews = ProductReview::whereNotIn('user_id',[auth()->user()->id])->where('product_id',$product->id)->get();
                $orders = Order::where('user_id',auth()->user()->id)->where('order_status',1)->get();

select * from `product_queries` where `product_id` = 17
select * from `product_reviews` where `product_id` = 17 and `status` = 1
---
                $review = null;
                $reviews = ProductReview::where('product_id',$product->id)->latest()->get();
            }
            $queries = ProductQueries::where('product_id',$product->id)->get();
            $reviewCounts =   ProductReview::where('product_id',$product->id)->where('status',1)->get();

select * from `products` where `category_id` = 9 and `id` not in (17) order by `created_at` desc limit 4
select * from `pages` where `status` = 1 order by `created_at` desc
select * from `categories` where `status` = 1 order by `created_at` desc
---
                }
                $reviewcount = $starTotal / count($reviewCounts);
            }
            $related_products = Product::where('category_id',$product->category_id)->whereNotIn('id',[$product->id])->latest()->take(4)->get();
            $pages = Pages::where('status',1)->latest()->get();
            return view('website.product.product-details',[
                'categories'=>Category::where('status',1)->latest()->get(),
                'product'=>$product,
                'seller_products'=> $product,
                'ProductReview'=> $ProductReview,
                'review'=> $review,
                'reviews'=> $reviews,
                'review1'=> $review1,
                'review2'=> $review2,
                'review3'=> $review3,
                'review4'=> $review4,
                'review5'=> $review5,
                'reviewcount'=> $reviewcount,
                'reviewCounts'=> $reviewCounts,
                'queries'=> $queries,
                'seller'=> $seller,
                'sellerShop'=> $sellerShop,
                'relatedProducts'=>$related_products,
                'pages'=>$pages,
            ]);

select * from `brands` where `status` = 1 order by `created_at` desc limit 18 offset 0
select count(*) as aggregate from `brands` where `status` = 1
select * from `categories` where `status` = 1 order by `created_at` desc
---
    public function brand(){
        try {
            return view('website.brand.index',[
                'brands'=>Brand::where('status',1)->latest()->paginate(18),
                'categories'=>Category::where('status',1)->latest()->get(),
            ]);