app/Http/Controllers/Seller/SellerController.php

select * from `users` where `email` = 'seller@gmail.com' and `role` = 'seller' limit 1
---
    public function sellerLogin(Request $request)
    {
        $validate = Validator::make($request->all(), [
            "email" => "required",
            "password" => "required|min:6",
        ]);
        if ($validate->fails()) {
            Toastr::error($validate->getMessageBag()->first());
            return redirect()->back()->withErrors($validate)->withInput();
        }
        $credentials = $request->only('email', 'password');
        $seller_user = User::where('email',$request->email)
                            ->where('role','seller')