app/Http/Controllers/Seller/SellerProductController.php

        public function create()
        {
            if(auth()->user()->status ==1){
                $parent_categories= Category::where('status',1)->get();
                $brands = Brand::where('status',1)->get();
                $colors = Color::where('status',1)->get();
                $units = Unit::where('status',1)->get();
---
select * from `categories` where `status` = 1
select * from `brands` where `status` = 1
select * from `colors` where `status` = 1
select * from `units` where `status` = 1