app/Http/Controllers/Seller/SellerDashboard.php

    public function sellerDashboard(){
        $product = Product::where('role','seller')->where('user_id',auth()->user()->id)->get();
        $order   = Order::where('user_id',auth()->user()->id)->get();
---
select * from `products` where `role` = 'seller' and `user_id` = 3
select * from `orders` where `user_id` = 3