app/Http/Controllers/AdminController.php

select * from `orders` where `payment_amount` not in (0)
select count(*) as aggregate from `orders` where `order_status` = 0
select count(*) as aggregate from `orders` where `order_status` = 3
select count(*) as aggregate from `orders` where `order_status` = 1
select count(*) as aggregate from `orders`
select count(*) as aggregate from `orders` where `order_status` = 2
select count(*) as aggregate from `customers`
select count(*) as aggregate from `sellers`
select count(*) as aggregate from `products`
select * from `orders` where `order_status` = 0 order by `created_at` desc
select * from `delivery_boys` where `status` = 1
---
    public function index(){
        $totalRevenue     = Order::whereNotIn('payment_amount',[0])->get();
        $pendingOrder     = Order::where('order_status',0)->count();
        $acceptedOrder     = Order::where('order_status',3)->count();
        $completeOrder     = Order::where('order_status',1)->count();
        $totalOrder     = Order::count();
        $cancelOrder     = Order::where('order_status',2)->count();
        $customer = Customer::count();
        $sellers = Seller::count();
        $product = Product::count();
        $orders = Order::where('order_status',0)->latest()->get();
        $deliveryBoys = DeliveryBoy::where('status', 1)->get();