app/Http/Controllers/CartController.php

    public function addToCartProduct(Request $request){
        try {
            if(!auth()->user()){
                return response()->json([
                    'status' => false,
                    'error' => "Please login first"
                ]);
            }

            $product = Product::find($request->product_id);
---
select * from `products` where `products`.`id` = '17' limit 1

            ];

            if($request->ajax()){
                CartItem::updateOrCreate($data, [
                    'product_id'    => $product->id,
                    'user_id'       => auth()->user()->id,
                    'name'          => $product->name,
                    'qty'           => $request->qty,
                    'price'         => $product->product_price,
                    'row_total'     => $product->product_price * $request->qty,
                    'size_id'       => $size_value,
                    'color_id'      => $color_value,
                    'image'         => $product->product_image,
                    'code'          => $product->code,
                    'seller_id'     => $product->user_id,
                    'shipping_cost' => $product->shipping_cost,
                    'variant_id'    => (isset($request->variant_id)? $request->variant_id : ''),
                ]);
                return response()->json([
                    'status' => true,
                    'message' => "Product added",
                    'count' => count(CartItem::where('user_id', auth()->user()->id)->get())
---
insert into `cart_items` (`product_id`, `user_id`, `size_id`, `color_id`, `name`, `qty`, `price`, `row_total`, `image`, `code`, `seller_id`, `shipping_cost`, `variant_id`, `updated_at`, `created_at`) values (17, 1, '', '', 'Easy Karchupi Panjabi white Easy Karchupi Panjabi white Easy Karchupi Panjabi white Easy Karchupi Panjabi white Easy Karchupi Panjabi white Easy Karchupi Panjabi white', '2', 3000, 6000, 'uploads/file-uploads/19a-1-370x444.jpg', '', 1, 60, '', '2024-05-30 11:06:58', '2024-05-30 11:06:58')
select * from `cart_items` where (`product_id` = 17 and `user_id` = 1 and `size_id` is null and `color_id` is null) limit 1
select * from `cart_items` where `user_id` = 1

    public function getCartDetails(){
        $cartContent = CartItem::where('user_id', auth()->user()->id)->get();
        $prices = CartItem::where('user_id', auth()->user()->id)->sum('row_total');
---
select * from `cart_items` where `user_id` = 1
select sum(`row_total`) as aggregate from `cart_items` where `user_id` = 1

    public function getCartCount(){
        $cartContent = CartItem::where('user_id', auth()->user()->id)->get();
---
select * from `cart_items` where `user_id` = 4