app/Http/Controllers/CustomerController.php

select * from `shippings` where `customer_id` = 4 limit 1
select * from `customer_wallets` where `user_id` = 4 limit 1
---
    public function index(){

        if(auth()->user()->role != 'customer'){
            Toastr::error("Invalid");
            return redirect()->route('home');
        }

        return view('customer.home',[
            'billings'=> BillingModel::where('customer_id', auth()->user()->id)->first(),
            'shippings'=> ShippingsModel::where('customer_id', auth()->user()->id)->first(),
            'wallet'=> CustomerWallet::where('user_id', auth()->user()->id)->first(),