app/Http/Controllers/CustomerAuthController.php

    public function login(Request $request){

        $validator = Validator::make($request->all(), [
            'email' => 'required|email',
            'password' => 'required',
        ]);

        if ($validator->fails()) {
            toastr()->error($validator->getMessageBag()->first());
            return redirect()->back()->withErrors($validator)->withInput();
        }
        $customer = User::where('email',$request->email)->first();
---
select * from `users` where `email` = 'customer@gmail.com' limit 1