app/Http/Controllers/FileUploadSelectionController.php

    public function saveSingleSelection(Request $request)
    {
        $selectedId = $request->single_image;
        $input_name = $request->input_name;

        $image = Upload::where('id', $selectedId)->orderBy('id', 'desc')->first();
---
select * from `uploads` where `id` = '37' order by `id` desc limit 1