app/Http/Controllers/Wishlist.php

    public function wishlistCouter(Request $request){
        $wishlistCount = count(ModelsWishlist::where('user_id', auth()->user()->id)->get());
---
select * from `wishlists` where `user_id` = 4