app/Models/BlogCategory.php

    public static function newBlogCategory($request){
        self::$blog_category = new BlogCategory();
        self::$blog_category->name = $request->name;
        self::$blog_category->status = $request->status;
        self::$blog_category->save();
---
insert into `blog_categories` (`name`, `status`, `updated_at`, `created_at`) values ('Rafael Glenn', '1', '2024-05-30 10:19:43', '2024-05-30 10:19:43')