app/Models/Upload.php

insert into `uploads` (`user_id`, `file_name`, `file_type`, `file_size`, `file`, `uploaded_by`, `updated_at`, `created_at`) values (1, '0540208_Jhotpot-Top-Slider-Web.jpeg', 'file', 204.48828125, 'uploads/file-uploads/0540208_Jhotpot-Top-Slider-Web.jpeg', 'Admin', '2024-05-30 11:31:04', '2024-05-30 11:31:04')
---
    public static function newFileUpload($request,$requestFiles){
        foreach ($requestFiles as $requestFile)
        {
            self::$file = $requestFile;
            self::$extension = self::$file->getClientOriginalExtension();
            self::$fileName = self::$file->getClientOriginalName();
            self::$fileSize = self::$file->getSize() / 1024;
            self::$fileType = self::$file->getType();
            self::$directory = 'uploads/file-uploads/';
            self::$file->move(self::$directory, self::$fileName);
            self::$fileUrl = self::$directory.self::$fileName;

            self::$file                = new Upload();
            self::$file->user_id       = auth()->user()->id;
            self::$file->file_name       = self::$fileName;
            self::$file->file_type         =  self::$fileType;
            self::$file->file_size         =  self::$fileSize;
            self::$file->file         =  self::$fileUrl;
            self::$file->uploaded_by         = str_replace(" ","_",$request->uploaded_by);
            self::$file->save();