app/Models/WebsiteSetting.php

    public static function updateWebsiteDetails($request,$id){
        self::$website = WebsiteSetting::find($id);
        if ($request->banner != ''){
            $banner = Upload::find($request->banner);
            self::$website->banner = $banner->file;
        }
        if ($request->icon != ''){
            $icon = Upload::find($request->icon);
            self::$website->icon = $icon->file;
        }
        if ($request->logo != ''){
            $logo = Upload::find($request->logo);
---
select * from `website_settings` where `website_settings`.`id` = 1 limit 1
select * from `uploads` where `uploads`.`id` = '37' limit 1