app/Providers/AppServiceProvider.php

select * from `product_types` where `status` = 1 order by `created_at` desc limit 3
select * from `uploads` where `user_id` = 1 order by `created_at` desc limit 24 offset 0
select count(*) as aggregate from `uploads` where `user_id` = 1
select count(*) as aggregate from `uploads` where `user_id` = 3
select * from `customers` where `user_id` = 1 limit 1
select * from `cart_items` where `user_id` = 1
select * from `website_sliders` where `status` = 1 order by `created_at` desc limit 3
select * from `website_sliders` where `status` = 1 order by `created_at` desc limit 1
select * from `website_sliders` where `status` = 1 order by `created_at` desc limit 4 offset 1
select * from `products` where `status` = 1 order by `created_at` desc limit 8
select * from `currencies` where `status` = 1 order by `updated_at` desc limit 1
select * from `currencies` order by `updated_at` desc
select * from `website_settings` where `status` = 1 limit 1
---
    public function boot(): void
    {
        View::composer(['admin.master'],function ($view){
            $view->with([
                'productTypes'=>ProductType::where('status',1)->latest()->take(3)->get(),
                'files'=> Upload::latest()->where('user_id',auth()->user()->id)->paginate(24),
            ]);
        });
        View::composer(['seller.Layout.master'],function ($view){
            $view->with([
                'files'=> Upload::latest()->where('user_id',auth()->user()->id)->paginate(24),
            ]);
        });

        View::composer(['*'],function ($view){
                    $view->with([
                        'website_setting'=> WebsiteSetting::first(),
                        'customer_info'=> auth()->check()?Customer::where('user_id', auth()->user()->id)->first() : [],
                        'cartItems'=> auth()->check() ? CartItem::where('user_id', auth()->user()->id)->get() : [],
                        'cartCount'=> auth()->check() ? count(CartItem::where('user_id', auth()->user()->id)->get()) : [],
                        'banners' => WebsiteSlider::where('status',1)->latest()->take(3)->get(),
                        'slider1' => WebsiteSlider::where('status',1)->latest()->take(1)->get(),
                        'sliders' => WebsiteSlider::where('status',1)->latest()->skip(1)->take(4)->get(),
                        'allPrducts' => Product::where('status', 1)->latest()->take(8)->get(),
                        'sortValue' => null,
                        'currency' => Currency::where('status',1)->orderBy('updated_at','desc')->first(),
                        'currencies' => Currency::orderBy('updated_at','desc')->get(),
                        'websiteInfos' => WebsiteSetting::where('status',1)->first(),

select * from `cart_items` where `user_id` = 0
select * from `website_settings` where `status` = 1 limit 1
---
                });

        View::composer(['website.layout.header'],function ($view){
                    $view->with([
                        'cartItems'=> auth()->check() ? CartItem::where('user_id', auth()->user()->id)->get() : [],
                    ]);
                });

        View::composer(['website.layout.app'],function ($view){
            $view->with([
                'websiteInfos' => WebsiteSetting::where('status',1)->first(),
            ]);

select * from `wishlists` where `user_id` = 0
---
        });
        if (Schema::hasTable('wishlists')){
            View::composer(['website.layout.app'],function ($view){
                $view->with([
                    'wishlist' => count(Wishlist::where('user_id',  (auth()->user())? auth()->user()->id : 0 )->get()),
                ]);