app/Http/Controllers/Admin/adminSalesController.php

select * from `orders` order by `id` desc
select * from `delivery_boys` where `status` = 1
---
    public function order()
    {
        $orders = Order::orderBy('id', 'DESC')->get();
        $deliveryBoys = DeliveryBoy::where('status', 1)->get();

select * from `orders_details` where `seller_id` = 1
select * from `orders` where `id` in (1, 2, 3, 4, 6, 12, 14, 15, 18, 24, 27, 28, 29, 30, 31, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42) order by `created_at` desc
select * from `delivery_boys` where `status` = 1
---
    public function inHouseOrder()
    {
        $orders = OrdersDetails::where('seller_id', 1)->get();
        $order_ids = array();
        foreach ($orders as $order) {
            if (!in_array($order->order_id, $order_ids)) {
                array_push($order_ids, $order->order_id);
            }
        }
        $orders = Order::whereIn('id', $order_ids)->latest()->get();

        $deliveryBoys = DeliveryBoy::where('status', 1)->get();

select * from `orders_details` where `seller_id` not in (1)
select * from `orders` where `id` in (5, 7) order by `created_at` desc
select * from `delivery_boys` where `status` = 1
---
    public function sellerOrder()
    {
        $orders = OrdersDetails::whereNotIn('seller_id', [1])->get();
        $order_ids = array();
        foreach ($orders as $order) {
            if (!in_array($order->order_id, $order_ids)) {
                array_push($order_ids, $order->order_id);
            }
        }
        $orders = Order::whereIn('id', $order_ids)->latest()->get();

        $deliveryBoys = DeliveryBoy::where('status', 1)->get();

select * from `orders` where `orders`.`id` = '41' limit 1
update `orders` set `delivery_status` = '0', `orders`.`updated_at` = '2024-05-30 10:10:11' where `id` = 41
---
    public function updateStatus(Request $request, $id)
    {
        $order = Order::find($id);
        $order->delivery_status = $request->delivery_status;
        $order->save();

select * from `orders` where `orders`.`id` = '42' limit 1
select * from `orders_details` where `order_id` = 42
---
    public function invoice($id)
    {
        $order = Order::find($id);
        $orderDetails = OrdersDetails::where('order_id', $order->id)->get();
        $tax = 0;
        foreach ($orderDetails as $orderDetail) {
            $tax = $orderDetail->tax_total + $tax;
        }
        return view('admin.invoice.invoice', [
            'order' => Order::find($id),
            'orderDetails' => $orderDetails,
            'tax' => $tax,
        ]);

select * from `orders` where `orders`.`id` = '41' limit 1
select * from `delivery_boy_orders` where `user_id` = '6' limit 1
update `delivery_boy_orders` set `pending_order` = 1, `delivery_boy_orders`.`updated_at` = '2024-05-30 10:45:06' where `id` = 2
---
    public function deliveryBoyAssign(Request $request, $id)
    {
        DB::beginTransaction();

        try {
            $order = Order::find($id);

            if (!$order) {
                Toastr::error('Order not found');
                return redirect()->back();
            }

            $order->deliveryBoy_id = $request->deliveryBoy_id;
            $order->deliveryBoy_pickup = 0;
            $order->delivery_date = $request->delivery_date;
            $order->save();

            $deliveryBoyOrder = DeliveryBoyOrder::where('user_id', $request->deliveryBoy_id)->first();

            if (!$deliveryBoyOrder) {
                DB::rollBack();
                Toastr::error('No Delivery Boy found');
                return redirect()->back();
            }

            $deliveryBoyOrder->pending_order = $deliveryBoyOrder->pending_order + 1;
            $deliveryBoyOrder->save();