app/Http/Controllers/Admin/BlogCategoryController.php

    public function index()
    {
        return view('admin.blog.category.index',[
            'categories'=>BlogCategory::all(),
        ]);
---
select * from `blog_categories`