app/Http/Controllers/Admin/BlogController.php

select * from `blogs` order by `created_at` desc
---
    public function index()
    {
        return view('admin.blog.index',[
            'blogs'=>Blog::latest()->get(),
        ]);

select * from `blog_categories` where `status` = 1
---
    public function create()
    {
        return view('admin.blog.add',[
            'blogCategories'=>BlogCategory::where('status',1)->get(),
        ]);