app/Http/Controllers/Admin/DeliveryBoyController.php

select * from `delivery_boys` order by `created_at` desc
---
    public function index()
    {
        return view('admin.delivery-boy.index',[
            'deliveryBoys'=>DeliveryBoy::latest()->get(),
        ]);

insert into `users` (`name`, `email`, `password`, `role`, `email_verified_at`, `status`, `updated_at`, `created_at`) values ('Alfreda Kemp', 'gezabule@mailinator.com', '$2y$12$SHneoADxJsc7UT3lRSU4o.s28xu9yZZZz2Vh76lTdi9bZ7vf487z.', 'delivery_boy', '2024-05-30 10:31:48', 1, '2024-05-30 10:31:48', '2024-05-30 10:31:48')
select * from `users` where `email` = 'gezabule@mailinator.com' limit 1
---
    public function store(Request $request)
    {
        try {
            $validate = Validator::make($request->all(), [
                "name"  => "required|min:3",
                "email" => "required|unique:users,email",
                'password' => 'required|min:8|required_with:confirm_password|same:confirm_password',
                'confirm_password' => 'required|min:8'
            ]);
            if ($validate->fails()) {
                toastr()->error($validate->getMessageBag()->first());
                return redirect()->back()->withErrors($validate)->withInput();
            }

            $user = new User();
            $user->name = $request->name;
            $user->email = $request->email;
            $user->password = bcrypt($request->password);
            $user->role = $request->role;
            $user->email_verified_at = Carbon::now();
            $user->status = 1;
            $user->save();

            $deliveryBoy = User::where('email', $request->email)->first();

insert into `delivery_boys` (`owner_id`, `user_id`, `name`, `designation`, `updated_at`, `created_at`) values ('1', 7, 'Alfreda Kemp', 'DeliveryBoy', '2024-05-30 10:31:48', '2024-05-30 10:31:48')
insert into `delivery_boy_orders` (`user_id`, `updated_at`, `created_at`) values (7, '2024-05-30 10:31:48', '2024-05-30 10:31:48')
---
                $delivery->image = $imageUrl;
            }
            $delivery->designation = 'DeliveryBoy';
            $delivery->save();

            $deliveryBoyOrder = new DeliveryBoyOrder();
            $deliveryBoyOrder->user_id = $deliveryBoy->id;
            $deliveryBoyOrder->save();