app/Http/Controllers/Admin/OrderController.php

    public function show($id)
    {
        $order = Order::find($id);
        $orderDetails = OrdersDetails::where('order_id',$order->id)->orderBy('seller_id')->get();
        $tax = 0;
        foreach($orderDetails as $orderDetail){
            $tax = $orderDetail->tax_total + $tax;
        }
        return view('admin.sales.show-order',[
            'order'=>Order::find($id),
            'orderDetails'=>$orderDetails,
            'tax'=>$tax,

        ]);
---
select * from `orders` where `orders`.`id` = '41' limit 1
select * from `orders_details` where `order_id` = 41 order by `seller_id` asc

    public function showInhouseOrderDetails($id)
    {
        $order = Order::find($id);
        $orderDetails = OrdersDetails::where('order_id',$order->id)->where('seller_id',auth()->user()->id)->get();
        $tax = 0;
        foreach($orderDetails as $orderDetail){
            $tax = $orderDetail->tax_total + $tax;
        }
        return view('admin.sales.show-inhouse-order',[
            'order'=>Order::find($id),
            'orderDetails'=>$orderDetails,
            'tax'=>$tax,
        ]);
---
select * from `orders` where `orders`.`id` = '41' limit 1
select * from `orders_details` where `order_id` = 41 and `seller_id` = 1