app/Http/Controllers/Admin/UploadController.php

    public function index(){
        $files = Upload::latest()->where('user_id',auth()->user()->id)->get();
---
select * from `uploads` where `user_id` = 1 order by `created_at` desc