app/Http/Controllers/Admin/WebsiteSettingController.php

select * from `website_settings` where `status` = 1 limit 1
---
    public function index()
    {
        return view('admin.website-setting.show',[
            'websiteSetting'=> WebsiteSetting::where('status',1)->first()->first(),
        ]);

select * from `website_settings` where `website_settings`.`id` = 1 limit 1
---
    public function edit(WebsiteSetting $websiteSetting)
    {
        return view('admin.website-setting.edit',[
            'websiteSetting'=>WebsiteSetting::find($websiteSetting->id),
        ]);